Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРожденияКлиента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

HTTPServices/users/Ext/Module.bsl
Функция getUserGET(Запрос)
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username"));
	
	ЗапросПользователи = Новый Запрос;
	Если Логин <> "" Тогда
		ЗапросПользователи.Текст =
		"ВЫБРАТЬ
		|    УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) КАК Ссылка,
		|    Пользователи.Наименование КАК Наименование,
		|    Пользователи.Код КАК Код
		|ИЗ
		|    Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|    НЕ Пользователи.ПометкаУдаления
		|    И Пользователи.Наименование = &Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|    Наименование";  
		
		ЗапросПользователи.УстановитьПараметр("Наименование", Логин); 
		
	КонецЕсли; 
	
	РезультатЗапроса = ЗапросПользователи.Выполнить();
	
	МассивПользователей= Новый Массив;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеПользователя = Новый Структура;
		ДанныеПользователя.Вставить("guid", Строка(Выборка.Ссылка));
		ДанныеПользователя.Вставить("name", Строка(Выборка.Наименование));
		ДанныеПользователя.Вставить("code", Строка(Выборка.Код));
		МассивПользователей.Добавить(ДанныеПользователя);
	КонецЦикла;
	
	Ответ = Новый HTTPСервисОтвет(200);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивПользователей);
	СтрокаОтвета = ЗаписьJSON.Закрыть();
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета);
	Возврат Ответ;
КонецФункции 

Функция regUserGET(Запрос) 
	
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username")); 
	Телефон = Строка(Запрос.ПараметрыЗапроса.Получить("phone")); 
	НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();  
	
	НовыйПользовательИБ.Имя = Логин;
	НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.Администратор);
	НовыйПользовательИБ.Записать(); НовыйПользователь = НовыйПользовательИБ;
	
	Контрагент = Справочники.Контрагенты.СоздатьЭлемент(); 
	Контрагент.Наименование = Логин;
	Контрагент.КонтактныйТелефон = Телефон; 
	Контрагент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент;
	Контрагент.Комментарий = "Зарегистрирован через мобильное приложение"; 
	Контрагент.Записать();
	
	Пользователь = Справочники.Пользователи.СоздатьЭлемент();
	Пользователь.Код = НовыйПользователь.УникальныйИдентификатор;
	Пользователь.Наименование = НовыйПользователь.Имя;
	Пользователь.Клиент = Контрагент.Ссылка;  
	
	Попытка  Пользователь.Записать();
		ТекстОтвета = "Создан пользователь " + Пользователь.Наименование;  
		Ответ = Новый HTTPСервисОтвет(200);
	Исключение  ТекстОтвета = "Произошла ошибка при записи пользователя " + Логин + "! ";
		Ответ = Новый HTTPСервисОтвет(500); 
	КонецПопытки; 
	
	Возврат Ответ; 	
КонецФункции
